tap "homebrew/cask"
cask_args appdir: "~/Applications", require_sha: true

brew "git"
brew "ripgrep"
brew "tmux"
brew "jq"
brew "yq"
brew "helm"
brew "gh"
brew "diff-so-fancy"
brew "awscli"
brew "kubie"
brew "htop"
brew "tfenv"
brew "asdf"
brew "bash-completion"
brew "fzf"
brew "gnupg"
brew "watch"

cask "google-chrome"
cask "visual-studio-code"
cask "discord"
cask "roon", args: { require_sha: false }
cask "aws-vault"
cask "iterm2"
cask "minecraft", args: { require_sha: false }
cask "gyazo"
cask "spotify", args: { require_sha: false }
