# File outlining all the tools and applications to install via Brewfile.

# Need to install core to be able to tap other tools
tap "homebrew/bundle"

# Install core CLI tools
brew "tmux"
brew "tpm"
brew "bash-completion"
brew "coreutils"
brew "diff-so-fancy"
brew "fzf"
brew "gnupg"
brew "htop"
brew "jq"
brew "ripgrep"
brew "watch"
brew "ykman"
brew "yq"
brew "gh"
brew "mise"

# Install project-specific tooling
# I might be able to remove all of these in favor of 'mise' configuration
# in each project in the future.
brew "tctl"
brew "temporal"
brew "hadolint"
brew "kubernetes-cli"
brew "kubie"
brew "krew"
brew "talosctl"
brew "helm"
brew "helmfile"
brew "awscli"
brew "tfenv"
# This installs the FluxCD CLI (be careful of the normal brew 'flux', which installs something else)
tap "fluxcd/tap"
brew "fluxcd/tap/flux"
brew "cilium-cli"

# Install a few helpful GUI apps
cask "orbstack"
cask "visual-studio-code"
