tap "homebrew/bundle"

# Install core CLI tools
brew "tmux"
brew "bash-completion"
brew "coreutils"
brew "diff-so-fancy"
brew "fzf"
brew "gnupg"
brew "htop"
brew "jq"
brew "ripgrep"
brew "watch"
brew "ykman"
brew "yq"

# Install tech-specific tooling
brew "gh"
brew "temporal"
brew "tctl"
brew "hadolint"
brew "go"
brew "kubernetes-cli"
brew "kubie"
brew "helm"
brew "awscli"
brew "flux"
brew "cilium-cli"

# Install a few helpful GUI apps
cask "orbstack"
cask "visual-studio-code"
cask "gather"
