tap "homebrew/bundle"
brew "awscli"
brew "bash-completion"
brew "coreutils"
brew "diff-so-fancy"
brew "fzf"
brew "gh"
brew "gnupg"
brew "helm"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "kubie"
brew "ripgrep"
brew "tmux"
brew "watch"
brew "ykman"
brew "yq"
cask "orbstack"
cask "visual-studio-code"
vscode "42crunch.vscode-openapi"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "aliariff.vscode-erb-beautify"
vscode "anchovystudios.zip-extract-all"
vscode "aswinkumar863.smarty-template-support"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bufbuild.vscode-buf"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "foxundermoon.shell-format"
vscode "fredwangwang.vscode-hcl-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "malmaud.tmux"
vscode "mindaro-dev.file-downloader"
vscode "mohsen1.prettify-json"
vscode "mongodb.mongodb-vscode"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "pflannery.vscode-versionlens"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shopify.ruby-lsp"
vscode "snowflake.snowflake-vsc"
vscode "sourcegraph.sourcegraph"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.copy-with-imports"
vscode "sysoev.vscode-open-in-github"
vscode "thiht.vscode-venom"
vscode "tim-koehler.helm-intellisense"
vscode "toanchivu.tcv-typescript-constructor-generator"
vscode "ue.alphabetical-sorter"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
